export const info = [
  {
    title: "О компании",
    subtitle_1: "Основная информация",
    subtitle_2: "История компании ",
  },
  {
    title: "Стройка и ремонт",
    subtitle_1: "Кейсы наших клиентов",
    subtitle_2: "Услуги которые мы оказываем ",
    subtitle_3: "Часто задаваемые вопросы ",
  },
  {
    title: "Покупка недвижимости",
    subtitle_1: "Кейсы наших клиентов",
    subtitle_2: "Топ 30 вопросов инвесторов ",
  },
  {
    title: "Маркетинговые услуги",
    subtitle_1: "Кейсы наших клиентов",
    subtitle_2: "Услуги которые мы оказываем ",
  },
];
