import { v1 } from "uuid";

export const quizData = [
  {
    repair: [
      {
        id: 0,
        title: "Где планируете делать ремонт?",
        values: [
          { id: v1(), value: "Новостройка", img: "" },
          { id: v1(), value: "Квартира", img: "" },
          { id: v1(), value: "Дом", img: "" },
          { id: v1(), value: "Коммерческий объект", img: "" },
        ],
      },
      {
        id: 1,
        title: "Какой вид ремонта вас интересует??",
        values: [
          { id: v1(), value: "Капитальный" },
          { id: v1(), value: "Косметический" },
          { id: v1(), value: "Дизайнерский" },
        ],
      },
      {
        id: 2,
        title: "Укажите общую площадь, м2?",
        values: [{ id: v1(), value: 0, img: "" }],
      },
      {
        id: 3,
        title: "Есть ли у вас дизайн проект?",
        values: [
          { id: v1(), value: "Да", img: "" },
          { id: v1(), value: "Есть понимание какой ремонт я хочу", img: "" },
          { id: v1(), value: "Готов(а) к вашим предложениям", img: "" },
        ],
      },
      {
        id: 4,
        title: "Когда вы планируете начать ремонт?",
        values: [
          { id: v1(), value: "Ближайшие 2 недели", img: "" },
          { id: v1(), value: "В течение месяца", img: "" },
          { id: v1(), value: "Через месяц и более", img: "" },
        ],
      },
    ],
  },
  {
    building: [
      {
        id: 1,
        title: "Данные по проекту",
        values: [
          {
            id: v1(),
            title: "Укажите общую площадь, м2",
            value: 0,
          },
          {
            id: v1(),
            title: "Укажите количество этажей",
            value: 0,
          },
          {
            id: v1(),
            title: "Вы можете направить нам данные по проекту",
            value: 0,
          },
          {
            id: v1(),
            title: "Последний этаж мансардный",
            value: 0,
          },
          {
            id: v1(),
            title: "Есть цокольный этаж",
            value: 0,
          },
        ],
      },
      {
        id: 2,
        title: "Вид строительства",
        values: [
          {
            id: v1(),
            title: "Дом из кирпича",
            value: 0,
          },
          {
            id: v1(),
            title: "Деревянный дом из бревна",
            value: 0,
          },
          {
            id: v1(),
            title: "Каркасный дом",
            value: 0,
          },
          {
            id: v1(),
            title: "Дом из газоблоков",
            value: 0,
          },
          {
            id: v1(),
            title: "Деревянный дом из бруса",
            value: 0,
          },
        ],
      },
      {
        id: 3,
        title: "Материал кровли",
        values: [
          {
            id: v1(),
            title: "Металлочерепица",
            value: 0,
          },
          {
            id: v1(),
            title: "Фальцевая кровля",
            value: 0,
          },
          {
            id: v1(),
            title: "Материал кровли не выбран",
            value: 0,
          },
          {
            id: v1(),
            title: "Гибкая черепица",
            value: 0,
          },
          {
            id: v1(),
            title: "Цементно-песчаная черепица",
            value: 0,
          },
        ],
      },
      {
        id: 4,
        title: "Внешняя отделка",
        values: [
          {
            id: v1(),
            title: "Кирпич облицовочный",
            value: 0,
          },
          {
            id: v1(),
            title: "Декоративная штукатурка",
            value: 0,
          },
          {
            id: v1(),
            title: "Отделка не требуется",
            value: 0,
          },
          {
            id: v1(),
            title: "Искусственный камень",
            value: 0,
          },
          {
            id: v1(),
            title: "Сайдинг",
            value: 0,
          },
        ],
      },
      {
        id: 5,
        title: "Когда вы планируете начать строительство?",
        values: [
          {
            id: v1(),
            title: "В течение месяца",
            value: 0,
          },
          {
            id: v1(),
            title: "В течение 3 месяцев",
            value: 0,
          },
          {
            id: v1(),
            title: "В течение полугода и более",
            value: 0,
          },
        ],
      },
    ],
  },
];
